# Задача-1:
# Напишите небольшую консольную утилиту, позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Просмотреть папки
# 2. Удалить папку
# 3. Создать папку
# При выборе второго или третьего пункта, программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено", "Невозможно создать/удалить"

# Для решения данной задачи используйте алоритмы из задания easy,
# оформленныйе в виде соответствующих функций, и импортированные в данный файл из easy.py
